---
kind: method
id: M:Autodesk.Revit.DB.Architecture.StairsLanding.GetStairs
source: html/b3f42d91-f8ea-ea09-fe74-d4fc9798343c.htm
---
# Autodesk.Revit.DB.Architecture.StairsLanding.GetStairs Method

Returns the stairs to which the landing belongs.

## Syntax (C#)
```csharp
public Stairs GetStairs()
```

## Returns
The stairs to which the landing belongs.